3-backward-step/backward-step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-50 0   -0.5)
    (-50 25  -0.5)
    (0   -25 -0.5)
    (0   0   -0.5)
    (0   25  -0.5)
    (250 -25 -0.5)
    (250 0   -0.5)
    (250 25  -0.5)

    (-50 0   0.5)
    (-50 25  0.5)
    (0   -25 0.5)
    (0   0   0.5)
    (0   25  0.5)
    (250 -25 0.5)
    (250 0   0.5)
    (250 25  0.5)
);

blocks
(
    hex (0 3 4 1 8 11 12 9)
    (50 25 1)
    simpleGrading (1 1 1)

    hex (2 5 6 3 10 13 14 11)
    (250 25 1)
    simpleGrading (1 1 1)

    hex (3 6 7 4 11 14 15 12)
    (250 25 1)
    simpleGrading (1 1 1)
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 8 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
            (0 3 11 8)
            (2 3 11 10)
            (2 5 13 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (8 11 12 9)
            (10 13 14 11)
            (11 14 15 12)
        );
    }
);

// ************************************************************************* //
