3-backward-step/backward-step/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01;

writeControl    runTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    printResiduals
    {
        type        residuals;
        libs        ("libutilityFunctionObjects.so");

        fields      ( U p );
    }


    averageInletPressure
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        regionType      patch;
        name            inlet;

        operation       areaAverage;
        writeFields     no;

        fields          ( p );
    }

    probes
    {
        type            probes;
        libs            ("libsampling.so");
 
        fields          ( U );
 
        probeLocations
        (
            ( 0.025 0 0 )
        );
    }
}

// ************************************************************************* //
